sahoo00/nRF52/TRG1/Application/main.c
    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];

        if (field_type == type)
        {
            p_typedata->p_data   = &p_data[index + 2];
            p_typedata->data_len = field_length - 1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}


/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    ret_code_t err_code;

    (void) sd_ble_gap_scan_stop();

    err_code = sd_ble_gap_scan_start(&m_scan_params);
    APP_ERROR_CHECK(err_code);

}


/**@brief Handles events coming from the LED Button central module.
 */
static void smph_evt_handler(ble_trg1_t * p_trg1, ble_trg1_evt_t * p_trg1_evt)
{
    switch (p_trg1_evt->evt_type)
    {
        case BLE_TRG1_EVT_DISCOVERY_COMPLETE:
        {
            if (m_ble_smph.conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                m_ble_smph.conn_handle = p_trg1_evt->conn_handle;
                NRF_LOG_INFO("SMPH discovered on conn_handle 0x%x", m_ble_smph.conn_handle);
                p_trg1->conn_handle = p_trg1_evt->conn_handle;
                p_trg1->peer_trg1_db = p_trg1_evt->params.peer_db;
            }
        } break; // BLE_TRG1_EVT_DISCOVERY_COMPLETE

        case BLE_TRG1_EVT_BUTTON_NOTIFICATION:
        default:
            // No implementation needed.
            break;
    }
}

static void trg2_evt_handler(ble_trg1_t * p_trg1, ble_trg1_evt_t * p_trg1_evt)
{
    switch (p_trg1_evt->evt_type)
    {
        case BLE_TRG1_EVT_DISCOVERY_COMPLETE:
        {
            if (m_ble_trg2.conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                m_ble_trg2.conn_handle = p_trg1_evt->conn_handle;
                NRF_LOG_INFO("TRG2 discovered on conn_handle 0x%x", m_ble_trg2.conn_handle);
                p_trg1->conn_handle = p_trg1_evt->conn_handle;
                p_trg1->peer_trg1_db = p_trg1_evt->params.peer_db;
            }
        } break; // BLE_TRG1_EVT_DISCOVERY_COMPLETE

        case BLE_TRG1_EVT_BUTTON_NOTIFICATION:
        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling the advertising report BLE event.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_adv_report(const ble_evt_t * const p_ble_evt)
{
    ret_code_t err_code;
    data_t     adv_data;
    data_t     dev_name;
    bool       do_connect = false;

    // For readibility.
    ble_gap_evt_t  const * p_gap_evt  = &p_ble_evt->evt.gap_evt;
    ble_gap_addr_t const * peer_addr  = &p_gap_evt->params.adv_report.peer_addr;

    // Initialize advertisement report for parsing
    adv_data.p_data   = (uint8_t *)p_gap_evt->params.adv_report.data;
    adv_data.data_len = p_gap_evt->params.adv_report.dlen;

    // Search for advertising names.
    bool name_found = false;
    err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME, &adv_data, &dev_name);

    if (err_code != NRF_SUCCESS)
    {
        // Look for the short local name if it was not found as complete.
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME, &adv_data, &dev_name);
        if (err_code != NRF_SUCCESS)
        {
            // If we can't parse the data, then exit
            return;
        }
        else
        {
            name_found = true;
        }
    }
    else
    {
        name_found = true;
    }

    if (name_found)
    {
        if (strlen(m_target_smph) != 0)
        {
            if (memcmp(m_target_smph, dev_name.p_data, dev_name.data_len )== 0)
            {
                do_connect = true;
            }
        }
        if (strlen(m_target_trg2) != 0)
        {
            if (memcmp(m_target_trg2, dev_name.p_data, dev_name.data_len )== 0)
            {
                do_connect = true;
            }
        }
    }

    if (do_connect)
    {
        // Initiate connection.
        err_code = sd_ble_gap_connect(peer_addr,
                                      &m_scan_params,
                                      &m_connection_param,
                                      APP_BLE_CONN_CFG_TAG);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    // For readability.
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    NRF_LOG_DEBUG("ble_evt_handler 0x%x %d %d %d", p_ble_evt->header.evt_id, p_gap_evt->conn_handle, m_ble_smph.conn_handle,
    		m_ble_trg2.conn_handle);
    switch (p_ble_evt->header.evt_id)
    {
        // Upon connection, check which peripheral has connected (HR or RSC), initiate DB
        // discovery, update LEDs status and resume scanning if necessary. */
        case BLE_GAP_EVT_CONNECTED:
        {
            NRF_LOG_INFO("Connected.");
            if (   (m_ble_smph.conn_handle  == BLE_CONN_HANDLE_INVALID)
                           || (m_ble_trg2.conn_handle == BLE_CONN_HANDLE_INVALID)) {
            	NRF_LOG_INFO("Attempt to find SMPH or TRG2 on conn_handle 0x%x", p_gap_evt->conn_handle);
            	err_code = ble_db_discovery_start(&m_db_discovery[0], p_gap_evt->conn_handle);
            	if (err_code == NRF_ERROR_BUSY)
            	{
            		err_code = ble_db_discovery_start(&m_db_discovery[1], p_gap_evt->conn_handle);
            		APP_ERROR_CHECK(err_code);
            	}
            	else
            	{
            		APP_ERROR_CHECK(err_code);
            	}
            }
        } break;

        // Upon disconnection, reset the connection handle of the peer which disconnected, update
        // the LEDs status and start scanning again.
        case BLE_GAP_EVT_DISCONNECTED:
        {
            if (p_gap_evt->conn_handle == m_ble_smph.conn_handle)
            {
                NRF_LOG_INFO("SMPH central disconnected (reason: %d)",
                             p_gap_evt->params.disconnected.reason);

