sahoo00/nRF52/TRG1/Application/main.c
                m_ble_smph.conn_handle = BLE_CONN_HANDLE_INVALID;
                m_ble_smph.ready_to_send = 0;
            }
            if (p_gap_evt->conn_handle == m_ble_trg2.conn_handle)
            {
                NRF_LOG_INFO("TRG2 central disconnected (reason: %d)",
                             p_gap_evt->params.disconnected.reason);

                m_ble_trg2.conn_handle = BLE_CONN_HANDLE_INVALID;
                m_ble_trg2.ready_to_send = 0;
            }

            if (   (m_ble_smph.conn_handle == BLE_CONN_HANDLE_INVALID)
                || (m_ble_trg2.conn_handle  == BLE_CONN_HANDLE_INVALID))
            {
                // Start scanning
                scan_start();
            }
        } break;

        case BLE_GAP_EVT_ADV_REPORT:
        {
            on_adv_report(p_ble_evt);
        } break;

        case BLE_GAP_EVT_TIMEOUT:
        {
            // We have not specified a timeout for scanning, so only connection attemps can timeout.
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                NRF_LOG_DEBUG("Connection request timed out.");
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        {
            // Accept parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                        &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
        } break;

#ifndef S140
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;
#endif

        case BLE_GATTC_EVT_TIMEOUT:
        {
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_TIMEOUT:
        {
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;

        default:
            // No implementation needed.
            break;
    }
}

uint32_t ble_trg1_init(ble_trg1_t * p_ble_trg1, ble_trg1_init_t * p_ble_trg1_init, uint16_t uuid)
{
    uint32_t      err_code;
    ble_uuid_t    trg1_uuid;
    ble_uuid128_t trg1_base_uuid = {TRG1_UUID_BASE};

    VERIFY_PARAM_NOT_NULL(p_ble_trg1);
    VERIFY_PARAM_NOT_NULL(p_ble_trg1_init);
    VERIFY_PARAM_NOT_NULL(p_ble_trg1_init->evt_handler);

    p_ble_trg1->peer_trg1_db.cccd_handle 			= BLE_GATT_HANDLE_INVALID;
    p_ble_trg1->peer_trg1_db.safety_alert_handle   = BLE_GATT_HANDLE_INVALID;
    p_ble_trg1->peer_trg1_db.alert_status_handle   = BLE_GATT_HANDLE_INVALID;

    p_ble_trg1->conn_handle                    = BLE_CONN_HANDLE_INVALID;
    p_ble_trg1->evt_handler                    = p_ble_trg1_init->evt_handler;
    p_ble_trg1->ready_to_send                  = 0;

    err_code = sd_ble_uuid_vs_add(&trg1_base_uuid, &p_ble_trg1->uuid_type);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    VERIFY_SUCCESS(err_code);

    trg1_uuid.type = p_ble_trg1->uuid_type;
    trg1_uuid.uuid = uuid;

    return ble_db_discovery_evt_register(&trg1_uuid);
}

/**@brief TRG1 client initialization.
 */
static void trg1_init(void)
{
    ret_code_t       err_code;
    ble_trg1_init_t smph_init_obj;
    ble_trg1_init_t trg2_init_obj;

    smph_init_obj.evt_handler = smph_evt_handler;
    trg2_init_obj.evt_handler = trg2_evt_handler;

    err_code = ble_trg1_init(&m_ble_smph, &smph_init_obj, SMPH_UUID_SERVICE);
    APP_ERROR_CHECK(err_code);

    err_code = ble_trg1_init(&m_ble_trg2, &trg2_init_obj, TRG2_UUID_SERVICE);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupts.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


void ble_trg1_on_db_disc_evt(ble_trg1_t * p_ble_trg1, ble_db_discovery_evt_t const * p_evt, uint16_t uuid)
{
    // Check if the Safety Service was discovered.
    if (p_evt->evt_type == BLE_DB_DISCOVERY_COMPLETE &&
        (p_evt->params.discovered_db.srv_uuid.uuid == uuid) &&
        p_evt->params.discovered_db.srv_uuid.type == p_ble_trg1->uuid_type)
    {
        ble_trg1_evt_t evt;

        evt.evt_type    = BLE_TRG1_EVT_DISCOVERY_COMPLETE;
        evt.conn_handle = p_evt->conn_handle;

		for (uint32_t i = 0; i < p_evt->params.discovered_db.char_count; i++) {
			const ble_gatt_db_char_t * p_char =
					&(p_evt->params.discovered_db.charateristics[i]);

			switch (p_char->characteristic.uuid.uuid) {
            case TRG1_SAFETY_ALERT:
            	NRF_LOG_HEXDUMP_INFO(&p_char->characteristic.uuid.uuid, 2);
                evt.params.peer_db.safety_alert_handle = p_char->characteristic.handle_value;
                break;
            case TRG1_ALERT_STATUS:
                evt.params.peer_db.alert_status_handle      = p_char->characteristic.handle_value;
                evt.params.peer_db.cccd_handle 				= p_char->cccd_handle;
                break;
			default:
				break;
			}
		}
		if (p_ble_trg1->conn_handle != BLE_CONN_HANDLE_INVALID) {
			if ((p_ble_trg1->peer_trg1_db.cccd_handle == BLE_GATT_HANDLE_INVALID)
					&& (p_ble_trg1->peer_trg1_db.safety_alert_handle == BLE_GATT_HANDLE_INVALID)
					&& (p_ble_trg1->peer_trg1_db.alert_status_handle	== BLE_GATT_HANDLE_INVALID)) {
				p_ble_trg1->peer_trg1_db = evt.params.peer_db;
			}
		}
        p_ble_trg1->evt_handler(p_ble_trg1, &evt);
        p_ble_trg1->ready_to_send = 5;
    }
}

