sahoo00/nRF52/TRG1/Application/main.c
/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_trg1_on_db_disc_evt(&m_ble_smph, p_evt, SMPH_UUID_SERVICE);
    ble_trg1_on_db_disc_evt(&m_ble_trg2, p_evt, TRG2_UUID_SERVICE);
}


/**@brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the log.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing the timer.
 */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Power manager. */
static void power_init(void)
{
    ret_code_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


static uint32_t send_data(ble_trg1_t * p_ble_trg1, uint8_t status) {
	if (!p_ble_trg1->ready_to_send) {
		return NRF_ERROR_INVALID_STATE;
	}
    VERIFY_PARAM_NOT_NULL(p_ble_trg1);

    if (p_ble_trg1->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    NRF_LOG_INFO("writing device ID 0x%x", status);
    device_id[0] = status;

    tx_message_t * p_msg;

    p_msg              = &m_tx_buffer[m_tx_insert_index++];
    m_tx_insert_index &= TX_BUFFER_MASK;

    p_msg->req.write_req.gattc_params.handle   = p_ble_trg1->peer_trg1_db.safety_alert_handle;
    p_msg->req.write_req.gattc_params.len      = sizeof(device_id);
    p_msg->req.write_req.gattc_params.p_value  = device_id;
    p_msg->req.write_req.gattc_params.offset   = 0;
    p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_CMD;
    p_msg->conn_handle                         = p_ble_trg1->conn_handle;
    p_msg->type                                = WRITE_REQ;

    tx_buffer_process();
    if (p_ble_trg1->ready_to_send > 0) {
    	p_ble_trg1->ready_to_send --;
    }
    return NRF_SUCCESS;
}

int main(void)
{
    log_init();
    timer_init();
    power_init();

	ble_stack_init();
	gatt_init();
	db_discovery_init();
	trg1_init();


    NRF_LOG_INFO("TRG1 started.");

	uint8_t button = 18;
	nrf_gpio_cfg_input(button, NRF_GPIO_PIN_PULLUP);

	// Start scanning for peripherals and initiate connection to devices which
    // advertise.
    scan_start();

    uint8_t status = 0;
    for (;;)
    {
    	//NRF_LOG_INFO("TRG1 %d", ready_to_send);
    	status = nrf_gpio_pin_read(button);
    	send_data(&m_ble_smph, 1 - status);
    	send_data(&m_ble_trg2, 1 - status);
    	status++;
    	nrf_delay_ms(2000);
        NRF_LOG_FLUSH();
        if (NRF_LOG_PROCESS() == false)
        {
            nrf_pwr_mgmt_run();
        }
    }
}
